%%
%%分号;会隐藏命令行的输出结果
%%

a= [
        1 2 3
        4 5 6
        7 8 9
   ];
a1 = [
         1 2
         -1 -3
];
b=a1'   ;            %矩阵转置
c=a1(:)       ;      %矩阵按列拉长
d=inv(a1)  ;         %求逆矩阵
e=zeros(10,5,3)  ;   %3维10行5列全0矩阵  3个矩阵 
e( :,  :, 1) = rand(10,5);  %10行5列随机数
e( :,  :, 2) = randi(6,10,5);%从0到6生成10行5列的矩阵
e( :,  :, 3) = randn(10,5);%生成10行5列的标准正态分布矩阵

A=cell(1,6);%计数（角标）从1开始
A{2} = eye(3);%3*3的对角线为1的单位矩阵
A{5} = magic(5); %生成n阶幻方 使得每列每行对角线的和相等
B = A{5};


books = struct('name',{{'aaa','bbb'}},'price',[32 45]);
books.name
books.name(1)
books.name{1};
%%
%矩阵构造
%%
A= [
        1 2 3
        4 5 6
        7 8 8
   ];
B=1:2:9;
C=repmat(B,3,2);%横着重复2次 竖着重复3次B
D=ones(4,4);%4行4列的全1矩阵

%%
%矩阵运算
%%
A= [
        1 2 3 4 
        5 6 7 8
   ];
B= [
        1 1 2 2 
        2 2 1 1
   ];
C=A+B;
D=A-B;
E=A*B';
F=A.*B ; %  . 对应项相乘
G=A/B   ;%  G*B=A  等价于A*B逆矩阵inv(B) 
H=A./B  ;%  . 对应项相除

%%
%矩阵下标
%%

A=magic(5);
B=A(2,3);
C=A(2,:)  ; % : 取全部
D=A(:,2)  ; % : 取全部
[m,n]=find(A>20); %找出大于20的 序号值/矩阵（m行n列）
[m,n]=find(A==1);

